---
kind: type
id: T:Autodesk.Revit.DB.LeaderEndCondition
source: html/c86e3feb-80c8-ab4c-e9cf-18875131b96a.htm
---
# Autodesk.Revit.DB.LeaderEndCondition

An enumerated type listing Leader end conditions that are supported for IndependentTags.

## Syntax (C#)
```csharp
public enum LeaderEndCondition
```